package com.alextim.SFI.service;

import lombok.AllArgsConstructor;

@AllArgsConstructor
public enum MsgStatus {
    SFI_OK(10, 0x8000, "СФИ готов", "СФИ не готов"),
    PWRSELFTEST(10, 0x4000, "Самотестирование при включении питания пройдено", "Самотестирование при включении питания не пройдено"),
    SELFTEST(10, 0x2000, "Тест пройден", "Тест не пройден"),
    SELFTEST_STATUS(10, 0x1000, "Самотестирование в процессе", "Самотестирование закончено"),
    PRM_2_K_2_ОК(10, 0x0800, "PRM2-K2 готов", "PRM2-K2 не готов"),
    PRM_2_K_1_ОК(10, 0x0400, "PRM2-K1 готов", "PRM2-K1 не готов"),
    PRM_1_K_2_ОК(10, 0x0200, "PRM1-K2 готов", "PRM1-K2 не готов"),
    PRM_1_K_1_ОК(10, 0x0100, "PRM1-K1 готов", "PRM1-K1 не готов"),
    PRD_ON(10, 0x0080, "Передатчик открыт", ""),
    PRD_OFF(10, 0x0040, "Передатчик закрыт", ""),
    PRD_STATUS(10, 0x0020, "Передатчик в процессе выполнения команды", ""),
    H_OK(10, 0x0010, "Данные достоверны", "Данные недостоверны"),
    POWEROFF_READY(10, 0x0008, "Готов к отключения питания", "Не готов к отключению питания"),
    LANDING(10, 0x0004, "Штатная посадка", "Нештатная посадка"),
    LIM(10, 0x0002, "Номер подстилающей поверхности принят", "Номер подстилающей поверхности не задан"),
    LTE(10, 0x0001, "Отстрел ЛТЭ", ""),
    LTE_REJECT(11, 0x8000, "Отказ ЛТЭ", ""),
    PU(11, 0x4000, "Раскрытие ПУ", ""),
    PU_REJECT(11, 0x2000, "Отказ ПУ", ""),
    LIM_ID(11, 0x1FF0, "Используемый номер подстилающей поверхности", ""),
    RESERVE(11, 0x000F, "", "");

    public final int cd;
    public final int mask;
    public final String comment1;
    public final String comment0;

    public static MsgStatus getByCode(int code) {
        return SFI_OK; //todo!!
    }
}